[UI_TREE]
EDITCfg=Einstellungen bearbeiten
MARKCfg = Markierungseinstellungen
3DCfg = 3D-Einstellung
ImportDxf_Type0Cfg=DXF-Importeinstellungen
SysCfg = Weitere Einstellungen

[Edit]
EDIT=Einstellungen bearbeiten
PointFilterPrecis = Genauigkeit des Filterpunkts (mm)
PointFilterAngle = Filterwinkel (Grad)
PointPrecisMoveStep = Schritt der Punktbewegung (mm)
MICRO = Position Feinabstimmungsschritt (mm)
MICROROTATE = Winkelfeinabstimmung der Schrittweite (Grad)
KLICK = Aufnahmegenauigkeit (mm)
UNDO = Anzahl der Phasen, für die die Anzahl der Stufen zurückgesetzt wird
ONETOTWO = Bruchpunktgenauigkeit (mm)
ExtendSpace = Skalierungsgenauigkeit (mm)
KillAngleSpace = Genauigkeit des Führungswinkels (mm)
PreViewZoomScale = Vorschau-Zoom
LayerCnt = Anzahl der Ebenen
JoinDistance = Maximaler Abstand der Kurvenverschmelzung
FastDrawEnable = Fülllinie zeigt Beschleunigung an
FastDrawEnableOption=Aus|Aktivieren

[MARK]
MARK = Markierungseinstellungen
SafeDoorRemark = ob die Schutztür geschlossen ist und ob die Markierung fortgesetzt werden soll
SafeDoorRemarkOption = Nein|Ja
CloseRedIfMark = ob das rote Licht beim Markieren automatisch ausgeschaltet wird
CloseRedIfMarkOption = Nein|Ja
RedPreviewLayerNo = Markierungsgeschwindigkeit für die Rotlichtvorschau

[3D]
3D = 3D-Einstellungen
3dModelPrecision = Verarbeitungsgenauigkeit des 3D-Modells
3dTrancePrecision = Genauigkeit der 3D-Datenkonvertierung
STLOptimize=Optimierung der STL-Modellzuordnung
STLOptimizeOption=Nein|Ja

[ImportDxf_Type0]
ImportDxf_Type0=DXF-Importeinstellungen
SepArc = Lichtbogengenauigkeit (5~255)
SepSpLine = Spline-Genauigkeit (5~255)

[Sys]
sys=Andere Einstellungen
CIRCLEPRECIS = Lichtbogengenauigkeit (mm)
SAMPLECOUNT = Anzahl der Samples pro Segment des Bogens
AIIMPORTPRECIS=Genauigkeit des Imports von AI-Dateien (mm)
PowerFill = Optimierung der Füllgeschwindigkeit
PowerFillOption=Nein|Ja
PowerDraw = Optimierung der Ziehgeschwindigkeit
PowerDrawOption=Nein|Ja
PowerRPViewFrame = Randoptimierung der Rotlichtvorschau
PowerRPViewFrameOption=Nein|Ja

[UI_FACE]
ExportSysPara = Export-Parameter...
ImportSysPara = Importparameter...
Ok=OK
Cancel = Abbrechen
Apply = Anwenden

;3DCALI DLG MAIN
[DLG_6000]
1019=Markierungs-Parameter-Einstellung
1021 = Markierung starten
1022 = Rotlicht-Vorschau
1023 = Kreisförmige Markierung
1024=Korrekturdatei exportieren
1025=Korrekturdatei importieren
1027=motorischer Bezugspunkt
1028 = Minimale Einstellposition
1029 = maximale Einstellposition
1030 = korrigiertes Inkrement
1031 = Bezugsbrennweite
1033=Parametrierung
6000 = Korrekturart
6001=Grundparameter
6002 = Motorposition
3=Korrekturdatei generieren
4 = Zurücksetzen

;3DCALI DLG PARAM
[DLG_140]
1035 = Anzahl der Markierungen
1036=Markiergeschwindigkeit (mm/s)
1037=Sprunggeschwindigkeit (mm/s)
1038=Q Frequenz (kHz)
1039=Q-Freigabe (us)
1040=Strom (A)
1041=Leistung (%)
1042=Modus
1051=Anwendung
2 = Abbrechen

; 3DCALI SAITE
[STRINGTABLE]
Motor position = Motorposition
Current focus = aktuelle Brennweite
Wrong motor parameters = falsche Motorparameter
Motor movement failure = Ausfall der Motorbewegung
Motor increment out of range (0.01mm~5mm) = Motorinkrement außerhalb des Bereichs (0,01 mm ~ 5 mm)
Focus of base plane out of range (>0mm) = Bezugsbrennweite außerhalb des Bereichs (>0 mm)
Cali data wrong,the focus must be monotonically increasing/decreasing = korrigiert Datenfehler, die Brennweite muss monoton zunehmen/abnehmen
Cali file detected, generation will modify the original file. It is recommended to back up (Export) the file first. Are you sure to continue generating? = Die Kalibrierungsdatei existiert bereits, das Generieren der Korrekturtabelle ändert die ursprüngliche Korrekturdatei, es wird empfohlen, sie zu sichern (zu exportieren) und dann zu generieren. Willst du weiter bauen?
Generating cali file false: Unable to open/create file = Fehler beim Generieren der Korrekturdatei: Datei kann nicht geöffnet/erstellt werden
Generating cali file false: Unable to write file = Korrekturdatei konnte nicht generiert werden: In Datei kann nicht geschrieben werden
Stop Marking = Markieren beenden
Start Marking = Markierung starten
Failed to stop marking = Fehler beim Beenden der Markierung
Failed to start marking = Markierungsfehler stoppen
Export success = Exporterfolg
Export failed: Can not find cali file or copy file failed=Export fehlgeschlagen: Die Korrekturdatei konnte nicht gefunden werden oder die Kopierdatei ist fehlgeschlagen
Import failed: Cali file does not exist = Import fehlgeschlagen: Korrekturdatei existiert nicht
Import failed: Unknow = Import fehlgeschlagen: unbekannter Fehler
Cali file already exists, do you want to replace it = Korrekturdatei existiert bereits, überschreiben?
Import success = Import erfolgreich
Import failed: Please manually copy the cali file to the '\\EMCC\\caliset\\%cardID%\\' directory = Import fehlgeschlagen: Bitte kopieren Sie die Kalibrierungsdatei manuell in das Verzeichnis 'EMCCcaliset%cardID%'
Data is not enough, please input at lease 2 rows = zu wenig Daten ein, bitte geben Sie mindestens zwei Datenzeilen ein
Generation of cali file succeeded = Erfolgreiche Generierung der Kalibrierungsdatei
Error: Handle of device.dll is null = Fehler: Das Handle .dll Geräts ist leer
Error: Card number wrong = Fehler: Die Seriennummer der Karte ist falsch
Error: Load device.dll or API failed = Fehler: Fehler beim Laden des Geräts oder seiner API .dll
Path of cali file wrong or SystemSet.ini not found = Korrekturdateiverzeichnisfehler oder SystemSet .ini nicht gefunden
Error: Open 3dmarker.dat failed = Fehler: Fehler beim Öffnen der 3dmarker.dat Datei
Error: Open .dat failed = Fehler: Fehler beim Öffnen .dat Datei
Error: Enter mark environment failed = Fehler: Fehler beim Aufrufen der Markierungsumgebung
Error: Leave mark environment failed = Fehler: Fehler beim Verlassen der Markierungsumgebung
